{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 28, 28, 1],
              "input_shape": [28, 28, 1],
              "dtype": "float32",
              "name": "input_layer"
            }
          },
          {
            "class_name": "Conv2D",
            "config": { "name": "conv2d", "trainable": true, "filters": 32, "kernel_size": [3, 3], "activation": "relu" }
          },
          { "class_name": "MaxPooling2D", "config": { "name": "max_pooling2d", "trainable": true, "pool_size": [2, 2], "strides": [2, 2] } },
          {
            "class_name": "Conv2D",
            "config": { "name": "conv2d_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "activation": "relu" }
          },
          { "class_name": "MaxPooling2D", "config": { "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2] } },
          {
            "class_name": "Conv2D",
            "config": { "name": "conv2d_2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "activation": "relu" }
          },
          { "class_name": "MaxPooling2D", "config": { "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2] } },
          { "class_name": "Dropout", "config": { "name": "dropout", "trainable": true, "rate": 0.5 } },
          { "class_name": "Flatten", "config": { "name": "flatten", "trainable": true } },
          { "class_name": "Dense", "config": { "name": "dense", "trainable": true, "units": 512, "activation": "relu" } },
          { "class_name": "Dense", "config": { "name": "dense_1", "trainable": true, "units": 10, "activation": "softmax" } }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["pesos.data"],
      "weights": [
        { "name": "conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" },
        { "name": "conv2d/bias", "shape": [32], "dtype": "float32" },
        { "name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" },
        { "name": "conv2d_1/bias", "shape": [64], "dtype": "float32" },
        { "name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32" },
        { "name": "conv2d_2/bias", "shape": [128], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [128, 512], "dtype": "float32" },
        { "name": "dense/bias", "shape": [512], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [512, 10], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [10], "dtype": "float32" }
      ]
    }
  ]
}